spec/cassettes/create_payment_on_successful_charge/creates_a_payment_with_the_webhook_from_stripe.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_19Ccu9FgeUvs3GmudtkaLLuU
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.56.0
      Authorization:
      - Bearer sk_test_uv6jMSQ54DycvURjLCpORYLW
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.56.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin16.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        Nietzsche.local 16.1.0 Darwin Kernel Version 16.1.0: Thu Oct 13 21:26:57 PDT
        2016; root:xnu-3789.21.3~60/RELEASE_X86_64 x86_64","hostname":"Nietzsche.local"}'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 05 Nov 2016 23:10:59 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2299'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_9VecMQVmeAY6s8
      Stripe-Version:
      - '2016-07-06'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_19Ccu9FgeUvs3GmudtkaLLuU",
          "object": "event",
          "api_version": "2016-07-06",
          "created": 1478385893,
          "data": {
            "object": {
              "id": "ch_19Ccu9FgeUvs3GmuN5SRAvSn",
              "object": "charge",
              "amount": 999,
              "amount_refunded": 0,
              "application": null,
              "application_fee": null,
              "balance_transaction": "txn_19Ccu9FgeUvs3Gmuau2iiuOQ",
              "captured": true,
              "created": 1478385893,
              "currency": "usd",
              "customer": "cus_9VeC7SVZmZNl4Z",
              "description": null,
              "destination": null,
              "dispute": null,
              "failure_code": null,
              "failure_message": null,
              "fraud_details": {},
              "invoice": "in_19Ccu9FgeUvs3GmuXFgoDnUy",
              "livemode": false,
              "metadata": {},
              "order": null,
              "outcome": {
                "network_status": "approved_by_network",
                "reason": null,
                "risk_level": "normal",
                "seller_message": "Payment complete.",
                "type": "authorized"
              },
              "paid": true,
              "receipt_email": null,
              "receipt_number": null,
              "refunded": false,
              "refunds": {
                "object": "list",
                "data": [],
                "has_more": false,
                "total_count": 0,
                "url": "/v1/charges/ch_19Ccu9FgeUvs3GmuN5SRAvSn/refunds"
              },
              "review": null,
              "shipping": null,
              "source": {
                "id": "card_19Ccu8FgeUvs3GmuWFNxnC6F",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_9VeC7SVZmZNl4Z",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 11,
                "exp_year": 2021,
                "fingerprint": "BKTw6Ixt61DE2nPW",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              },
              "source_transfer": null,
              "statement_descriptor": "myflix basic",
              "status": "succeeded"
            }
          },
          "livemode": false,
          "pending_webhooks": 0,
          "request": "req_9VeC70ssUNo6FV",
          "type": "charge.succeeded"
        }
    http_version: 
  recorded_at: Sat, 05 Nov 2016 23:10:59 GMT
recorded_with: VCR 3.0.3
